/*******************************************************************************************************************
Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. 
(можно решить через строку, а можно математически)
14212 -> нет
12821 -> да
23432 -> да
*********************************************************************************************************************/
// Решение 1:

Console.Write("Введите пятизначное число: ");
int num = int.Parse(Console.ReadLine()!);

if (num < 10000 || num > 100000)
{
    Console.WriteLine("Ваше число не пятизначное");
}
else
{
    int a1 = num / 10000;
    int a2 = (num / 1000) % 10;
    int a4 = (num % 100) / 10;
    int a5 = num % 10;
    if (a1 == a5 && a2 == a4)
    {
        Console.WriteLine($"Число {num} - палиндромом");
    }
    else
    {
        Console.WriteLine($"Число {num} - не палиндромом");
    }
}


